// Работа с if-else

// номер 1
// Если переменная a равна нулю, то выведите 'Верно', иначе выведите 'Неверно'. 
// Проверьте работу скрипта при a, равном 1, 0, -3.

// let a = -3;
// if(a == 0){
//     console.log("Верно");
// } else {
//     console.log("Неверно");
// }

// номер 2
// Если переменная a больше нуля, то выведите 'Верно', иначе выведите 'Неверно'. 
// Проверьте работу скрипта при a, равном 1, 0, -3.

// let a = -3;
// if(a > 0){
//     console.log("Верно");
// } else {
//     console.log("Неверно");
// }

// номер 3
// Если переменная a меньше нуля, то выведите 'Верно', иначе выведите 'Неверно'. 
// Проверьте работу скрипта при a, равном 1, 0, -3.

// let a = -3;
// if(a<0){
//     console.log("Верно");
// } else {
//     console.log("Неверно");
// }

// номер 4
// Если переменная a больше или равна нулю, то выведите 'Верно', иначе выведите 'Неверно'. 
// Проверьте работу скрипта при a, равном 1, 0, -3.

// let a = -3;
// if(a<0){
//     console.log("Верно");
// } else {
//     console.log("Неверно");
// }

// номер 5
// Если переменная a меньше или равна нулю, то выведите 'Верно', иначе выведите 'Неверно'. 
// Проверьте работу скрипта при a, равном 1, 0, -3.

// let a = -3;
// if(a<=0){
//     console.log("Верно");
// } else {
//     console.log("Неверно");
// }

// номер 6
// Если переменная a не равна нулю, то выведите 'Верно', иначе выведите 'Неверно'. 
// Проверьте работу скрипта при a, равном 1, 0, -3.

// let a = 1;
// if(a!=0){
//     console.log("Верно");
// } else {
//     console.log("Неверно");
// }

// номер 7
// Если переменная a равна 'test', то выведите 'Верно', иначе выведите 'Неверно'. 
// Проверьте работу скрипта при a, равном 'test', 'тест', 3.

// let a = 3;
// if(a=='test'){
//     console.log("Верно");
// } else {
//     console.log("Неверно");
// }

// номер 8
// Если переменная a равна '1' и по значению и по типу, то выведите 'Верно', иначе выведите 'Неверно'. 
// Проверьте работу скрипта при a, равном '1', 1, 3.

// let a = 1;
// if(a ==='1'){
//     console.log("Верно");
// } else {
//     console.log("Неверно");
// }